---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NotEnoughElements
source: html/cb720bf6-8ecc-6c86-1984-0f1318185842.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NotEnoughElements Property

The calculation could not be executed as configured. Specify at least 3 elements before analyzing this network.

## Syntax (C#)
```csharp
public static FailureDefinitionId Network_NotEnoughElements { get; }
```